app/controllers/catagories_controller.rb

  def index
    @catagories = Catagory.all
---
SELECT * FROM `catagories`

  def show
    @catagory = Catagory.find(params[:id])
---
SELECT * FROM `catagories` WHERE (`catagories`.`id` = 1)

  def create
    @catagory = Catagory.new(params[:catagory])

    respond_to do |format|
      if @catagory.save
---
INSERT INTO `catagories` (`name`, `created_at`, `updated_at`) VALUES('Book', '2009-10-30 15:03:26', '2009-10-30 15:03:26')