app/controllers/store_controller.rb

  def index
    if session[:counter].nil?
      session[:counter] = 1
    else
      session[:counter] = session[:counter] + 1
    end
    #@products = Product.find_products_for_sale
   # @catagories = Catagory.find_catagories_for_sale
     @catagories = Catagory.all(:order => "name, products.title",
                              :include => :products)
---
SELECT * FROM `catagories` ORDER BY name
SELECT * FROM `products` WHERE (`products`.catagory_id = 1)

  def delete_from_cart
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 3)

  def remove_from_cart
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 3)

  def add_to_cart
    product = Product.find(params[:id])
    @cart = find_cart
    @current_item = @cart.add_product(product)
    @cat_cart = @cart.items.group_by{|cart| cart.product.catagory}
---
SELECT * FROM `products` WHERE (`products`.`id` = 2)
SELECT * FROM `catagories` WHERE (`catagories`.`id` = 1)

  def save_order
    @cart = find_cart
    @cat_cart = @cart.items.group_by{|cart| cart.product.catagory}
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2009-11-09 15:02:31', 3, 1, 1, 12.0, '2009-11-09 15:02:31')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('tom', '123123', '2009-11-09 15:02:31', '2009-11-09 15:02:31', 'cc', 'dfasdfsdfasdf')