app/controllers/users_controller.rb

def create
  @user = User.new(params[:user])
  respond_to do |format|
    if @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('1834b2045ec062634599aa66558ab5bcedc3153a', '2009-11-11 13:58:16', '98023c5cd923b349c23e1f373e5bb811dedc02cf', NULL, '2009-11-11 13:58:16', NULL, 'test', 'test@test.com')